Revit 2024 API
EnergyAnalysisConstruction.ThermalMass Property
 The thermal mass value (Cth-value) of the construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double ThermalMass { get; }
Visual Basic
Public ReadOnly Property ThermalMass As Double
	Get
Visual C++
public:
property double ThermalMass {
	double get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace